# fetch registry
tap "homebrew/cask-fonts"
tap "daipeihust/tap" # for im-select

# apps
cask 'google-chrome'
cask 'cursor'
cask 'ghostty'
cask 'surge'
cask 'feishu'
cask 'wechat'
cask 'obsidian'
cask 'refine'
cask 'ticktick'
cask 'raycast'
cask 'input-source-pro'
brew 'popclip'
cask 'logi-options+'
cask 'mos'
cask 'betterdisplay'
cask 'yaak'
cask 'orbstack'
cask 'dataflare'
cask 'spotify'

# command line tools
brew 'zx'
brew "fish"
brew "starship"
brew "neovim"
brew "lsd"
brew "jq"
brew "ripgrep"
brew "zoxide"
brew 'difftastic'
brew 'fzf'
brew "im-select"
brew "fnm" # node version manager
brew "uv" # python package and project manager

# programming languages
brew "go"
brew "rust"
brew "swift"
brew "lua"

# fonts
cask "font-maple-mono-normal-nf-cn"
