# 'brew tap'
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# 'brew install'
brew "fish"
brew "starship"
brew "httpie"
brew "ffmpeg"
brew "lua"
brew "neovim"
brew "tmux"
brew "wget"
brew "you-get"
brew "gnupg"

# 'brew install --cask'
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "google-chrome"
cask "visual-studio-code"
cask "alacritty"
cask "raycast"
cask "ticktick"
cask "mouse-fix"
cask "keyboardholder"
cask "shottr"
cask "wechat"
cask "feishu"
cask "qqmusic"
