# fetch registry
tap "homebrew/cask-fonts"
tap "daipeihust/tap"

# apps
cask 'google-chrome'
cask "visual-studio-code"
cask 'ghostty'
cask 'surge'
cask 'obsidian'
cask 'ticktick'
cask 'raycast'
brew 'popclip'
cask 'mos'
cask "keyboardholder"
cask 'betterdisplay'
cask 'yaak'
cask 'orbstack'
cask 'dataflare'
cask 'qqmusic'
cask 'telegram'

# command line tools
brew 'zx'
brew "fish"
brew "starship"
brew "neovim"
brew "lua"
brew "lsd"
brew "jq"
brew "fnm"
brew "ripgrep"
brew "zoxide"
brew 'difftastic'
brew 'fzf'
brew "im-select"

# fonts
cask "font-maple-mono-normal-nf-cn"
